In [2]:
import pandas as pd
from sqlalchemy import create_engine
from datetime import date, timedelta
import calendar

pd.options.display.max_rows = 30

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
const = engine.connect()

format_dict = {'Q4':'{:.4f}','Q3':'{:.4f}','Q2':'{:.4f}','Q1':'{:.4f}','DIVIDEND':'{:.4f}',
              'PRICE':'{:.2f}','PERCENT':'{:.2f}%','SHARES':'{:,}'}

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
box_path = "\\Users\\User\\Dropbox\\"
today = date.today()
today

datetime.date(2021, 12, 28)

### Start of New buy record

In [5]:
name = "IMH"
new_cost = 11
new_qty = 9000

In [9]:
sql = """
SELECT * 
FROM buy 
WHERE active = 1 AND name = '%s'
ORDER BY name"""
sql = sql % name
df = pd.read_sql(sql, const)
df.set_index('name', inplace=True)
df['volume'] = df.volbuy.astype(int)
cols = 'date volume price active dividend period grade'.split()
df[cols]

            date  volume  price  active  dividend period grade
name
IMH   2021-12-08    9000   11.0       1       0.0      3    A3

In [7]:
sql = """
INSERT INTO buy 
VALUES('IMH','2021-12-08',9000,11,0,0,1,0,'3','A3')
"""
print(sql)

INSERT INTO buy
VALUES('IMH','2021-12-08',9000,11,0,0,1,0,'3','A3')

In [8]:
rp = const.execute(sql)
rp.rowcount

1

### End of new buy

### Start of buy update

In [3]:
def update_buy(shares,price,name,period):
    sql = "UPDATE buy SET volbuy = %s, price = %s WHERE name = '%s' AND period = '%s'"
    sql = sql % (shares, price, name, period)
    rp = const.execute(sql)
    return "Records updated = " + str(rp.rowcount)

In [7]:
name = 'RJH'
sql = """
SELECT * 
FROM buy 
WHERE active = 1 AND name = '%s'
ORDER BY name"""
sql = sql % name
df = pd.read_sql(sql, const)
df.set_index('name', inplace=True)
df['volume'] = df.volbuy.astype(int)
cols = 'date volume price active dividend period grade'.split()
df[cols]

            date  volume  price  active  dividend period grade
name
RJH   2021-11-09    4500   33.0       1       1.7      3    A3

In [5]:
shares = 4500
price =  33
period = '3'
(name, shares, price, period)

('RJH', 4500, 33, '3')

In [6]:
update_buy(shares,price,name,period)

'Records updated = 1'

### Change grade from quarterly performance

In [2]:
def update_buy_grade(grade,period,name):
    sql = "UPDATE buy SET grade = '%s', period = %s WHERE name = '%s' AND active=1"
    sql = sql % (grade, period, name)
    rp = const.execute(sql)
    return "Records updated = " + str(rp.rowcount)

In [17]:
name = 'RCL'
sql = """
SELECT * 
FROM buy 
WHERE name = '%s'
"""
sql = sql % name
df_tmp = pd.read_sql(sql, const)
df_tmp['volume'] = df_tmp.volbuy.astype(int)
cols = 'date volume price active dividend period grade'.split()
df_tmp[cols]

         date  volume  price  active  dividend period grade
0  2021-11-08    4500   43.0       1       3.5      3    A4

In [16]:
grade = 'A4'
period = '3'

update_buy_grade(grade,period,name)

'Records updated = 1'

### End of Buy update

### When sold out

In [3]:
name = 'LH'
sql = '''
DELETE FROM buy 
WHERE name = "%s"
AND period = "1"'''
sql = sql % name
print(sql)

DELETE FROM buy
WHERE name = "LH"
AND period = "1"

In [4]:
rp = const.execute(sql)
rp.rowcount

1

### End of sold out

In [7]:
sql = """
SELECT * 
FROM buy 
WHERE active = 1
ORDER BY name"""
df = pd.read_sql(sql, const)
df.set_index('name', inplace=True)
df['volume'] = df.volbuy.astype(int)
cols = 'date volume price active dividend period grade'.split()
df[cols].loc['HREIT']

date        2020-08-14
volume           20000
price             8.03
active               1
dividend        0.6909
period               4
grade               A1
Name: HREIT, dtype: object

### New dividend stock

In [8]:
pd.set_option('display.float_format','{:,.6f}'.format)

In [10]:
name = 'IMH'
sql = """
SELECT * 
FROM DIVIDEND
WHERE name = '%s'
"""
sql = sql % name
df = pd.read_sql(sql, const)
df

Empty DataFrame
Columns: [NAME, Q4, Q3, Q2, Q1, DIVIDEND, PRICE, PERCENT, SHARES, XDATE, PAIDDATE, KIND, ACTUAL]
Index: []

In [19]:
sql = """
INSERT INTO dividend
VALUES('KBANK',2.50,0.00,0.50,0.0,3.00,0,0,000,'2022-04-20','2022-05-07','',0)
"""
rp = const.execute(sql)
rp.rowcount

1

### Start of Update dividend

In [8]:
def update_shares(shares,actual,name):
    sql = "UPDATE dividend SET shares = %s, actual = %s WHERE name = '%s'"
    sql = sql % (shares, actual, name)
    rp = const.execute(sql)
    return "Records updated = " + str(rp.rowcount)

In [11]:
name = 'RJH'
sql = """
SELECT * 
FROM DIVIDEND
WHERE name = '%s'
"""
sql = sql % name
df = pd.read_sql(sql, const)
df['SHARES'] = df['SHARES'].astype(int)
df.style.format(format_dict)

In [10]:
shares = 4500
actual = 0
update_shares(shares,actual,name)

'Records updated = 1'

### Update total dividend from dividend file to buy file

In [17]:
sql = '''
UPDATE buy B
SET dividend =
(SELECT DIVIDEND FROM dividend D
WHERE B.name = D.name)'''
rp = const.execute(sql)
rp.rowcount

35

### Delete dividend record

In [5]:
sql = '''
DELETE FROM dividend
WHERE name IN ("LH")
'''
rp = const.execute(sql)
rp.rowcount

1

### End of Delete dividend record

### Calculate dividend amt by quarter

In [6]:
sql = """
SELECT NAME AS name, xdate as xd_date, paiddate AS pay_date, Q1 AS qtr,
SHARES AS shares, Q3*SHARES AS dividend
FROM dividend
WHERE q3 > 0 AND shares > 0
ORDER BY name"""
df_div = pd.read_sql(sql, const)
df_div.set_index('name', inplace=True)
df_div.sort_values(['dividend'],ascending=[False])

          xd_date    pay_date     qtr    shares  dividend
name
JASIF  2021-11-18  2021-12-04  0.2400  120000.0   30000.0
MCS    2021-11-21  2021-12-04  0.0000   70000.0   17500.0
DIF    2021-11-11  2021-12-04  0.2610   60000.0   15660.0
STA    2021-11-26  2021-12-09  1.0000   12500.0    6250.0
CPNCG  2021-11-16  2021-12-03  0.2515   20000.0    5030.0
IVL    2021-11-23  2021-12-09  0.1750   21000.0    3675.0
BKI    2021-11-26  2021-12-09  3.5000    1000.0    3000.0
DCC    2021-11-17  2021-11-30  0.0500   40000.0    1800.0

In [7]:
df_div.dividend.sum()

82915.0

In [8]:
sql = '''
SELECT name, volbuy AS shares, price AS unit_cost, volbuy * price AS cost 
FROM buy'''
df_buy = pd.read_sql(sql, const)
df_buy['shares'] = df_buy.shares.astype(int)
df_buy.dtypes

name          object
shares         int32
unit_cost    float64
cost         float64
dtype: object

In [9]:
df_merge = pd.merge(df_buy, df_div, on='name', how='inner')
df_merge['pct'] = df_merge['dividend'] / df_merge['cost'] * 100
df_merge.sort_values(by=['pct','name'],ascending=[False,True])

,name,shares_x,unit_cost,cost,xd_date,pay_date,qtr,shares_y,dividend,pct
6,JASIF,10000,10.00,100000.0,2021-11-18,2021-12-04,0.2400,120000.0,30000.0,30.000000
2,IVL,3000,42.00,126000.0,2021-11-23,2021-12-09,0.1750,21000.0,3675.0,2.916667
5,JASIF,110000,10.00,1100000.0,2021-11-18,2021-12-04,0.2400,120000.0,30000.0,2.727273
8,CPNCG,20000,10.85,217000.0,2021-11-16,2021-12-03,0.2515,20000.0,5030.0,2.317972
4,DIF,60000,14.70,882000.0,2021-11-11,2021-12-04,0.2610,60000.0,15660.0,1.775510
9,DCC,40000,2.90,116000.0,2021-11-17,2021-11-30,0.0500,40000.0,1800.0,1.551724
3,MCS,70000,16.70,1169000.0,2021-11-21,2021-12-04,0.0000,70000.0,17500.0,1.497006
0,STA,12500,37.25,465625.0,2021-11-26,2021-12-09,1.0000,12500.0,6250.0,1.342282
7,BKI,1000,276.00,276000.0,2021-11-26,2021-12-09,3.5000,1000.0,3000.0,1.086957
1,IVL,18000,42.00,756000.0,2021-11-23,2021-12-09,0.1750,21000.0,3675.0,0.486111

In [10]:
df_merge.dividend.sum()

116590.0

In [11]:
file_name = 'div-21q3.csv'
data_file = data_path + file_name
output_file = csv_path + file_name
df_merge.reset_index
df_merge.sort_values(by=['xd_date','name'],ascending=[True,True]).to_csv(output_file)
df_merge.sort_values(by=['xd_date','name'],ascending=[True,True]).to_csv(data_file)

### Past 2 weeks price, max, min to determine selling, buying prices

In [51]:
name = 'GVREIT'
name

'GVREIT'

In [52]:
sql = """
SELECT *
FROM price
WHERE name = '%s'
ORDER BY date ASC"""
sql = sql % name
print(sql)

SELECT *
FROM price
WHERE name = 'GVREIT'
ORDER BY date ASC

In [53]:
df_price = pd.read_sql(sql, const)
df_price.shape

(1299, 7)

In [54]:
df_tmp = df_price.tail(10)
df_tmp

        name        date  price  maxp  minp      qty  opnp
1289  GVREIT  2021-09-27   10.3  10.3  10.2   192900  10.3
1290  GVREIT  2021-09-28   10.2  10.3  10.2   206003  10.2
1291  GVREIT  2021-09-29   10.2  10.3  10.2    16900  10.2
1292  GVREIT  2021-09-30   10.3  10.3  10.2    78600  10.2
1293  GVREIT  2021-10-01   10.4  10.4  10.2    25800  10.3
1294  GVREIT  2021-10-04   10.3  10.3  10.3  1110800  10.3
1295  GVREIT  2021-10-05   10.4  10.4  10.3   202200  10.3
1296  GVREIT  2021-10-06   10.6  10.6  10.4    68502  10.4
1297  GVREIT  2021-10-07   10.7  10.8  10.6   233107  10.6
1298  GVREIT  2021-10-08   10.7  10.7  10.6    13322  10.6

In [55]:
df_tmp.maxp.value_counts()

10.3    5
10.4    2
10.6    1
10.8    1
10.7    1
Name: maxp, dtype: int64

In [56]:
df_tmp.minp.value_counts()

10.2    5
10.3    2
10.6    2
10.4    1
Name: minp, dtype: int64

In [57]:
df_tmp.maxp.max(),df_tmp.minp.min()

(10.8, 10.2)

### Change purchase date

In [4]:
sql = "UPDATE buy SET date = '2021-05-10' WHERE name = 'LH' AND active=1"
rp = const.execute(sql)
rp.rowcount

1